HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxCif_regdef.h
/** \\brief  Debug Path User Defined Symbol Register */
typedef struct _Ifx_CIF_DP_UDS_Bits
{
    Ifx_Strict_32Bit UDS:15;                /**< \brief [14:0] User Defined Symbol which may be inserted into debug stream (rw) */
    Ifx_Strict_32Bit reserved_15:17;        /**< \brief \internal Reserved */
} Ifx_CIF_DP_UDS_Bits;

/** \\brief  CIF Data Path Control Register */
typedef struct _Ifx_CIF_DPCL_Bits
{
    Ifx_Strict_32Bit CIF_MP_MUX:2;          /**< \brief [1:0] Data path selector for main path (rw) */
    Ifx_Strict_32Bit CIF_CHAN_MODE:2;       /**< \brief [3:2] Y/C splitter channel mode (rw) */
    Ifx_Strict_32Bit reserved_4:4;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit IF_SELECT:2;           /**< \brief [9:8] Selects input interface (rw) */
    Ifx_Strict_32Bit reserved_10:22;        /**< \brief \internal Reserved */
} Ifx_CIF_DPCL_Bits;

/** \\brief  Extra Path Image Cropping Control Register */
typedef struct _Ifx_CIF_EP_IC_CTRL_Bits
{
    Ifx_Strict_32Bit IC_EN:1;               /**< \brief [0:0] Image Cropping Enable (rw) */
    Ifx_Strict_32Bit reserved_1:31;         /**< \brief \internal Reserved */
} Ifx_CIF_EP_IC_CTRL_Bits;

/** \\brief  Extra Path Image Cropping Camera Displacement Register */
typedef struct _Ifx_CIF_EP_IC_DISPLACE_Bits
{
    Ifx_Strict_32Bit DX:12;                 /**< \brief [11:0] Camera Displacement (rw) */
    Ifx_Strict_32Bit reserved_12:4;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit DY:12;                 /**< \brief [27:16] Camera Displacement (rw) */
    Ifx_Strict_32Bit reserved_28:4;         /**< \brief \internal Reserved */
} Ifx_CIF_EP_IC_DISPLACE_Bits;

/** \\brief  Extra Path Image Cropping Horizontal Offset of Output Window
 * Register */
typedef struct _Ifx_CIF_EP_IC_H_OFFS_Bits
{
    Ifx_Strict_32Bit H_OFFS:12;             /**< \brief [11:0] Horizontal Picture Offset (rw) */
    Ifx_Strict_32Bit reserved_12:20;        /**< \brief \internal Reserved */
} Ifx_CIF_EP_IC_H_OFFS_Bits;

/** \\brief  Extra Path Image Current Horizontal Offset Of Output Window Shadow
 * Register */
typedef struct _Ifx_CIF_EP_IC_H_OFFS_SHD_Bits
{
    Ifx_Strict_32Bit H_OFFS_SHD:13;         /**< \brief [12:0] Horizontal Picture Offset (r) */
    Ifx_Strict_32Bit reserved_13:19;        /**< \brief \internal Reserved */
} Ifx_CIF_EP_IC_H_OFFS_SHD_Bits;

/** \\brief  Extra Path Image Cropping Output Horizontal Picture Size Register */
typedef struct _Ifx_CIF_EP_IC_H_SIZE_Bits
{
    Ifx_Strict_32Bit H_SIZE:12;             /**< \brief [11:0] Horizontal Picture Size (rw) */
    Ifx_Strict_32Bit reserved_12:20;        /**< \brief \internal Reserved */
} Ifx_CIF_EP_IC_H_SIZE_Bits;

/** \\brief  Extra Path Image Current Output Horizontal Picture Size Shadow
 * Register */
typedef struct _Ifx_CIF_EP_IC_H_SIZE_SHD_Bits
{
    Ifx_Strict_32Bit H_SIZE_SHD:13;         /**< \brief [12:0] Horizontal Picture Size (r) */
    Ifx_Strict_32Bit reserved_13:19;        /**< \brief \internal Reserved */
} Ifx_CIF_EP_IC_H_SIZE_SHD_Bits;

/** \\brief  Extra Path Image Cropping Maximum Horizontal Displacement Register */
typedef struct _Ifx_CIF_EP_IC_MAX_DX_Bits
{
    Ifx_Strict_32Bit MAX_DX:12;             /**< \brief [11:0] Maximum Horizontal Displacement (rw) */
    Ifx_Strict_32Bit reserved_12:20;        /**< \brief \internal Reserved */
} Ifx_CIF_EP_IC_MAX_DX_Bits;

/** \\brief  Extra Path Image Cropping Maximum Vertical Displacement Register */
typedef struct _Ifx_CIF_EP_IC_MAX_DY_Bits
{
    Ifx_Strict_32Bit MAX_DY:12;             /**< \brief [11:0] Maximum Vertical Displacement (rw) */
    Ifx_Strict_32Bit reserved_12:20;        /**< \brief \internal Reserved */
} Ifx_CIF_EP_IC_MAX_DY_Bits;

/** \\brief  Extra Path Image Cropping Recenter Register */
typedef struct _Ifx_CIF_EP_IC_RECENTER_Bits
{
    Ifx_Strict_32Bit RECENTER:3;            /**< \brief [2:0] Recenter (rw) */
    Ifx_Strict_32Bit reserved_3:29;         /**< \brief \internal Reserved */
} Ifx_CIF_EP_IC_RECENTER_Bits;

/** \\brief  Extra Path Image Cropping Vertical Offset Of Output Window Register */
typedef struct _Ifx_CIF_EP_IC_V_OFFS_Bits
{
    Ifx_Strict_32Bit V_OFFS:12;             /**< \brief [11:0] Vertical Picture Offset (rw) */
    Ifx_Strict_32Bit reserved_12:20;        /**< \brief \internal Reserved */
} Ifx_CIF_EP_IC_V_OFFS_Bits;

/** \\brief  Extra Path Image Current Vertical Offset Of Output Window Shadow
 * Register */
typedef struct _Ifx_CIF_EP_IC_V_OFFS_SHD_Bits
{
    Ifx_Strict_32Bit V_OFFS_SHD:12;         /**< \brief [11:0] Vertical Picture Offset (r) */
    Ifx_Strict_32Bit reserved_12:20;        /**< \brief \internal Reserved */
} Ifx_CIF_EP_IC_V_OFFS_SHD_Bits;

/** \\brief  Extra Path Image Cropping Output Vertical Picture Size Register */
typedef struct _Ifx_CIF_EP_IC_V_SIZE_Bits
{
    Ifx_Strict_32Bit V_SIZE:12;             /**< \brief [11:0] Vertical Picture Size (rw) */
    Ifx_Strict_32Bit reserved_12:20;        /**< \brief \internal Reserved */
} Ifx_CIF_EP_IC_V_SIZE_Bits;

/** \\brief  Extra Path Image Current Output Vertical Picture Size Shadow
 * Register */
typedef struct _Ifx_CIF_EP_IC_V_SIZE_SHD_Bits
{
    Ifx_Strict_32Bit V_SIZE_SHD:12;         /**< \brief [11:0] Vertical Picture Size (r) */
    Ifx_Strict_32Bit reserved_12:20;        /**< \brief \internal Reserved */
} Ifx_CIF_EP_IC_V_SIZE_SHD_Bits;

/** \\brief  CIF Internal Clock Control Register */
typedef struct _Ifx_CIF_ICCL_Bits
{
    Ifx_Strict_32Bit CIF_ISP_CLK_ENABLE:1;  /**< \brief [0:0] ISP processing clock enable (rw) */
    Ifx_Strict_32Bit reserved_1:4;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CIF_JPEG_CLK_ENABLE:1; /**< \brief [5:5] JPEG encoder clock enable (rw) */
    Ifx_Strict_32Bit CIF_MI_CLK_ENABLE:1;   /**< \brief [6:6] Memory interface clock enable (rw) */
    Ifx_Strict_32Bit reserved_7:9;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CIF_WATCHDOG_CLK_ENABLE:1; /**< \brief [16:16] Security Watchdog clock enable (rw) */
    Ifx_Strict_32Bit CIF_LIN_DSCALER_CLK_ENABLE:1;  /**< \brief [17:17] Linear Downscaler clock enable (rw) */
    Ifx_Strict_32Bit CIF_EXTRA_PATHS_CLK_ENABLE:1;  /**< \brief [18:18] Extra Paths clock enable (rw) */
    Ifx_Strict_32Bit CIF_DEBUG_PATH_CLK_EN:1;   /**< \brief [19:19] Debug Path clock enable (rw) */
    Ifx_Strict_32Bit reserved_20:12;        /**< \brief \internal Reserved */
} Ifx_CIF_ICCL_Bits;

/** \\brief  CIF Revision Identification Register */
typedef struct _Ifx_CIF_ID_Bits
{
    Ifx_Strict_32Bit MODREV:8;              /**< \brief [7:0] Module Revision Number (r) */
    Ifx_Strict_32Bit MODTYPE:8;             /**< \brief [15:8] Module Type (r) */
    Ifx_Strict_32Bit MODNUMBER:16;          /**< \brief [31:16] Module Number Value (r) */
} Ifx_CIF_ID_Bits;

/** \\brief  CIF Internal Reset Control Register */
typedef struct _Ifx_CIF_IRCL_Bits
{
    Ifx_Strict_32Bit CIF_ISP_SOFT_RST:1;    /**< \brief [0:0] Isp software reset (rw) */
    Ifx_Strict_32Bit reserved_1:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CIF_YCS_SOFT_RST:1;    /**< \brief [2:2] Y/C splitter software reset (rw) */
    Ifx_Strict_32Bit reserved_3:2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CIF_JPEG_SOFT_RST:1;   /**< \brief [5:5] JPEG encoder software reset (rw) */
    Ifx_Strict_32Bit CIF_MI_SOFT_RST:1;     /**< \brief [6:6] Memory interface software reset (rw) */
    Ifx_Strict_32Bit CIF_GLOBAL_RST:1;      /**< \brief [7:7] Soft reset of entire CIF (rw) */
    Ifx_Strict_32Bit reserved_8:8;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CIF_WATCHDOG_RST:1;    /**< \brief [16:16] Securtiy Watchdog software reset (rw) */
    Ifx_Strict_32Bit CIF_LIN_DSCALER_RST:1; /**< \brief [17:17] Linear Downscaler software reset (rw) */
    Ifx_Strict_32Bit CIF_EXTRA_PATHS_RST:1; /**< \brief [18:18] Extra Paths software reset (rw) */
    Ifx_Strict_32Bit CIF_DEBUG_PATH_RST:1;  /**< \brief [19:19] Debug Path software reset (rw) */
    Ifx_Strict_32Bit reserved_20:12;        /**< \brief \internal Reserved */
} Ifx_CIF_IRCL_Bits;

