HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxCif_regdef.h
/** \\brief  Memory Interface Base Address For Extra Path Data Buffer Register */
typedef struct _Ifx_CIF_MIEP_CH_BASE_AD_INIT_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit EP_BASE_AD_INIT:30;    /**< \brief [31:2] Extra Path Base Address Init (rw) */
} Ifx_CIF_MIEP_CH_BASE_AD_INIT_Bits;

/** \\brief  Memory Interface Base Address Shadow Register for Extra Path Buffer
 * Register */
typedef struct _Ifx_CIF_MIEP_CH_BASE_AD_SHD_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit EP_BASE_AD:30;         /**< \brief [31:2] Extra Path Base Address (r) */
} Ifx_CIF_MIEP_CH_BASE_AD_SHD_Bits;

/** \\brief  Memory Interface Extra Path Control Register */
typedef struct _Ifx_CIF_MIEP_CH_CTRL_Bits
{
    Ifx_Strict_32Bit EP_ENABLE:1;           /**< \brief [0:0] Enables enable ep picture data path (rw) */
    Ifx_Strict_32Bit reserved_1:6;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit BYTE_SWAP:1;           /**< \brief [7:7] Byte Swap Enable (rw) */
    Ifx_Strict_32Bit reserved_8:12;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit INIT_BASE_EN:1;        /**< \brief [20:20] Init Base Address Enable (rw) */
    Ifx_Strict_32Bit INIT_OFFSET_EN:1;      /**< \brief [21:21] Init Offset Counter Enable (rw) */
    Ifx_Strict_32Bit EP_WRITE_FORMAT:2;     /**< \brief [23:22] Extra Path Write Format (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MIEP_CH_CTRL_Bits;

/** \\brief  Memory Interface Extra Path Control Internal Shadow Register */
typedef struct _Ifx_CIF_MIEP_CH_CTRL_SHD_Bits
{
    Ifx_Strict_32Bit EP_ENABLE_IN:1;        /**< \brief [0:0] Extra Path In Enable (r) */
    Ifx_Strict_32Bit reserved_1:15;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit EP_ENABLE_OUT:1;       /**< \brief [16:16] Extra Path Out Enable (r) */
    Ifx_Strict_32Bit reserved_17:15;        /**< \brief \internal Reserved */
} Ifx_CIF_MIEP_CH_CTRL_SHD_Bits;

/** \\brief  Memory Interface Extra Path Control Register For Address Init And
 * Skip Function Register */
typedef struct _Ifx_CIF_MIEP_CH_INIT_Bits
{
    Ifx_Strict_32Bit reserved_0:2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit MI_EP_SKIP:1;          /**< \brief [2:2] Skip Picture (w) */
    Ifx_Strict_32Bit reserved_3:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit MI_EP_CFG_UPD:1;       /**< \brief [4:4] Forced Configuration Update (w) */
    Ifx_Strict_32Bit reserved_5:27;         /**< \brief \internal Reserved */
} Ifx_CIF_MIEP_CH_INIT_Bits;

/** \\brief  Memory Interface Fill Level Interrupt Offset Value For Extra Path
 * Register */
typedef struct _Ifx_CIF_MIEP_CH_IRQ_OFFS_INIT_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit EP_IRQ_OFFS_INIT:22;   /**< \brief [23:2] Extra Path Y IRQ Offset Init (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MIEP_CH_IRQ_OFFS_INIT_Bits;

/** \\brief  Memory Interface Shadow Register of Fill Level Interrupt Offset
 * Value For Extra Path Register */
typedef struct _Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit EP_IRQ_OFFS:22;        /**< \brief [23:2] Extra Path IRQ Offset (r) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD_Bits;

/** \\brief  Memory Interface Offset Counter Init Value For Extra Path Buffer
 * Register */
typedef struct _Ifx_CIF_MIEP_CH_OFFS_CNT_INIT_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit EP_OFFS_CNT_INIT:22;   /**< \brief [23:2] Extra Path Offset Counter Init (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MIEP_CH_OFFS_CNT_INIT_Bits;

/** \\brief  Memory Interface Current Offset Counter of Extra Path Buffer
 * Register */
typedef struct _Ifx_CIF_MIEP_CH_OFFS_CNT_SHD_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit EP_OFFS_CNT:22;        /**< \brief [23:2] Extra Path Y Offset Counter (r) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MIEP_CH_OFFS_CNT_SHD_Bits;

/** \\brief  Memory Interface Offset Counter Start Value For Extra Path Register */
typedef struct _Ifx_CIF_MIEP_CH_OFFS_CNT_START_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit EP_OFFS_CNT_START:22;  /**< \brief [23:2] Extra Path Offset Counter Start (r) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MIEP_CH_OFFS_CNT_START_Bits;

/** \\brief  Memory Interface Size of Extra Path Data Buffer Register */
typedef struct _Ifx_CIF_MIEP_CH_SIZE_INIT_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit EP_SIZE_INIT:22;       /**< \brief [23:2] Extra Path Size Init (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MIEP_CH_SIZE_INIT_Bits;

/** \\brief  Memory Interface Size Shadow Register of Extra Path Buffer Register */
typedef struct _Ifx_CIF_MIEP_CH_SIZE_SHD_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit EP_SIZE:22;            /**< \brief [23:2] Extra Path Size (r) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MIEP_CH_SIZE_SHD_Bits;

/** \\brief  MI Extra Path Interrupt Clear Register */
typedef struct _Ifx_CIF_MIEP_ICR_Bits
{
    Ifx_Strict_32Bit FRAME_END_EP_1:1;      /**< \brief [0:0] Extra Path 1 Frame End (w) */
    Ifx_Strict_32Bit FILL_EP_1:1;           /**< \brief [1:1] Fill Extra Path 1 (w) */
    Ifx_Strict_32Bit WRAP_EP_1:1;           /**< \brief [2:2] Wrap Extra Path 1 (w) */
    Ifx_Strict_32Bit MBLK_LINE_EP_1:1;      /**< \brief [3:3] Macro Block Line Interrupt Extra Path 1 (w) */
    Ifx_Strict_32Bit FRAME_END_EP_2:1;      /**< \brief [4:4] Extra Path 2 Frame End (w) */
    Ifx_Strict_32Bit FILL_EP_2:1;           /**< \brief [5:5] Fill Extra Path 2 (w) */
    Ifx_Strict_32Bit WRAP_EP_2:1;           /**< \brief [6:6] Wrap Extra Path 2 (w) */
    Ifx_Strict_32Bit reserved_7:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit FRAME_END_EP_3:1;      /**< \brief [8:8] Extra Path 3 Frame End (w) */
    Ifx_Strict_32Bit FILL_EP_3:1;           /**< \brief [9:9] Fill Extra Path 3 (w) */
    Ifx_Strict_32Bit WRAP_EP_3:1;           /**< \brief [10:10] Wrap Extra Path 3 (w) */
    Ifx_Strict_32Bit MBLK_LINE_EP_3:1;      /**< \brief [11:11] Macro Block Line Interrupt Extra Path 3 (w) */
    Ifx_Strict_32Bit FRAME_END_EP_4:1;      /**< \brief [12:12] Extra Path 4 Frame End (w) */
    Ifx_Strict_32Bit FILL_EP_4:1;           /**< \brief [13:13] Fill Extra Path 4 (w) */
    Ifx_Strict_32Bit WRAP_EP_4:1;           /**< \brief [14:14] Wrap Extra Path 4 (w) */
    Ifx_Strict_32Bit MBLK_LINE_EP_4:1;      /**< \brief [15:15] Macro Block Line Interrupt Extra Path 4 (w) */
    Ifx_Strict_32Bit FRAME_END_EP_5:1;      /**< \brief [16:16] Extra Path 5 Frame End (w) */
    Ifx_Strict_32Bit FILL_EP_5:1;           /**< \brief [17:17] Fill Extra Path 5 (w) */
    Ifx_Strict_32Bit WRAP_EP_5:1;           /**< \brief [18:18] Wrap Extra Path 5 (w) */
    Ifx_Strict_32Bit MBLK_LINE_EP_5:1;      /**< \brief [19:19] Macro Block Line Interrupt Extra Path 5 (w) */
    Ifx_Strict_32Bit reserved_20:12;        /**< \brief \internal Reserved */
} Ifx_CIF_MIEP_ICR_Bits;

/** \\brief  MI Extra Path Interrupt Mask ‘1’: interrupt active, ‘0’: interrupt
 * masked */
typedef struct _Ifx_CIF_MIEP_IMSC_Bits
{
    Ifx_Strict_32Bit FRAME_END_EP_1:1;      /**< \brief [0:0] Extra Path 1 Frame End (rw) */
    Ifx_Strict_32Bit FILL_EP_1:1;           /**< \brief [1:1] Fill Extra Path 1 (rw) */
    Ifx_Strict_32Bit WRAP_EP_1:1;           /**< \brief [2:2] Wrap Extra Path 1 (rw) */
    Ifx_Strict_32Bit MBLK_LINE_EP_1:1;      /**< \brief [3:3] Macro Block Line Interrupt Extra Path 1 (rw) */
    Ifx_Strict_32Bit FRAME_END_EP_2:1;      /**< \brief [4:4] Extra Path 2 Frame End (rw) */
    Ifx_Strict_32Bit FILL_EP_2:1;           /**< \brief [5:5] Fill Extra Path 2 (rw) */
    Ifx_Strict_32Bit WRAP_EP_2:1;           /**< \brief [6:6] Wrap Extra Path 2 (rw) */
    Ifx_Strict_32Bit MBLK_LINE_EP_2:1;      /**< \brief [7:7] Macro Block Line Interrupt Extra Path 2 (rw) */
    Ifx_Strict_32Bit FRAME_END_EP_3:1;      /**< \brief [8:8] Extra Path 3 Frame End (rw) */
    Ifx_Strict_32Bit FILL_EP_3:1;           /**< \brief [9:9] Fill Extra Path 3 (rw) */
    Ifx_Strict_32Bit WRAP_EP_3:1;           /**< \brief [10:10] Wrap Extra Path 3 (rw) */
    Ifx_Strict_32Bit MBLK_LINE_EP_3:1;      /**< \brief [11:11] Macro Block Line Interrupt Extra Path 3 (rw) */
    Ifx_Strict_32Bit FRAME_END_EP_4:1;      /**< \brief [12:12] Extra Path 4 Frame End (rw) */
    Ifx_Strict_32Bit FILL_EP_4:1;           /**< \brief [13:13] Fill Extra Path 4 (rw) */
    Ifx_Strict_32Bit WRAP_EP_4:1;           /**< \brief [14:14] Wrap Extra Path 4 (rw) */
    Ifx_Strict_32Bit MBLK_LINE_EP_4:1;      /**< \brief [15:15] Macro Block Line Interrupt Extra Path 4 (rw) */
    Ifx_Strict_32Bit FRAME_END_EP_5:1;      /**< \brief [16:16] Extra Path 5 Frame End (rw) */
    Ifx_Strict_32Bit FILL_EP_5:1;           /**< \brief [17:17] Fill Extra Path 5 (rw) */
    Ifx_Strict_32Bit WRAP_EP_5:1;           /**< \brief [18:18] Wrap Extra Path 5 (rw) */
    Ifx_Strict_32Bit MBLK_LINE_EP_5:1;      /**< \brief [19:19] Macro Block Line Interrupt Extra Path 5 (rw) */
    Ifx_Strict_32Bit reserved_20:12;        /**< \brief \internal Reserved */
} Ifx_CIF_MIEP_IMSC_Bits;

/** \\brief  MI Extra Path Interrupt Set Register */
typedef struct _Ifx_CIF_MIEP_ISR_Bits
{
    Ifx_Strict_32Bit FRAME_END_EP_1:1;      /**< \brief [0:0] Extra Path 1 Frame End (w) */
    Ifx_Strict_32Bit FILL_EP_1:1;           /**< \brief [1:1] Fill Extra Path 1 (w) */
    Ifx_Strict_32Bit WRAP_EP_1:1;           /**< \brief [2:2] Wrap Extra Path 1 (w) */
    Ifx_Strict_32Bit MBLK_LINE_EP_1:1;      /**< \brief [3:3] Macro Block Line Interrupt Extra Path 1 (w) */
    Ifx_Strict_32Bit FRAME_END_EP_2:1;      /**< \brief [4:4] Extra Path 2 Frame End (w) */
    Ifx_Strict_32Bit FILL_EP_2:1;           /**< \brief [5:5] Fill Extra Path 2 (w) */
    Ifx_Strict_32Bit WRAP_EP_2:1;           /**< \brief [6:6] Wrap Extra Path 2 (w) */
    Ifx_Strict_32Bit MBLK_LINE_EP_2:1;      /**< \brief [7:7] Macro Block Line Interrupt Extra Path 2 (w) */
    Ifx_Strict_32Bit FRAME_END_EP_3:1;      /**< \brief [8:8] Extra Path 3 Frame End (w) */
    Ifx_Strict_32Bit FILL_EP_3:1;           /**< \brief [9:9] Fill Extra Path 3 (w) */
    Ifx_Strict_32Bit WRAP_EP_3:1;           /**< \brief [10:10] Wrap Extra Path 3 (w) */
    Ifx_Strict_32Bit MBLK_LINE_EP_3:1;      /**< \brief [11:11] Macro Block Line Interrupt Extra Path 3 (w) */
    Ifx_Strict_32Bit FRAME_END_EP_4:1;      /**< \brief [12:12] Extra Path 4 Frame End (w) */
    Ifx_Strict_32Bit FILL_EP_4:1;           /**< \brief [13:13] Fill Extra Path 4 (w) */
    Ifx_Strict_32Bit WRAP_EP_4:1;           /**< \brief [14:14] Wrap Extra Path 4 (w) */
    Ifx_Strict_32Bit MBLK_LINE_EP_4:1;      /**< \brief [15:15] Macro Block Line Interrupt Extra Path 4 (w) */
    Ifx_Strict_32Bit FRAME_END_EP_5:1;      /**< \brief [16:16] Extra Path 5 Frame End (w) */
    Ifx_Strict_32Bit FILL_EP_5:1;           /**< \brief [17:17] Fill Extra Path 5 (w) */
    Ifx_Strict_32Bit WRAP_EP_5:1;           /**< \brief [18:18] Wrap Extra Path 5 (w) */
    Ifx_Strict_32Bit MBLK_LINE_EP_5:1;      /**< \brief [19:19] Macro Block Line Interrupt Extra Path 5 (w) */
    Ifx_Strict_32Bit reserved_20:12;        /**< \brief \internal Reserved */
} Ifx_CIF_MIEP_ISR_Bits;

