HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxCif_regdef.h
/** \\brief  Watchdog Control Register */
typedef struct _Ifx_CIF_WD_CTRL_Bits
{
    Ifx_Strict_32Bit WD_EN:1;               /**< \brief [0:0] Enable Security Watchdog (rw) */
    Ifx_Strict_32Bit RST_H_CNT:1;           /**< \brief [1:1] Reset Horizontal Counter (w) */
    Ifx_Strict_32Bit RST_V_CNT:1;           /**< \brief [2:2] Reset Vertical Counter (w) */
    Ifx_Strict_32Bit RST_PD_CNT:1;          /**< \brief [3:3] Reset Predivider Counter (w) */
    Ifx_Strict_32Bit reserved_4:12;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit WD_PREDIV:16;          /**< \brief [31:16] Watchdog Counter Predivider (rw) */
} Ifx_CIF_WD_CTRL_Bits;

/** \\brief  Watchdog Horizontal Timeout Register */
typedef struct _Ifx_CIF_WD_H_TIMEOUT_Bits
{
    Ifx_Strict_32Bit WD_HSE_TO:16;          /**< \brief [15:0] Watchdog Horizontal Start End Timeout (rw) */
    Ifx_Strict_32Bit WD_HES_TO:16;          /**< \brief [31:16] Watchdog Horizontal End Start Timeout (rw) */
} Ifx_CIF_WD_H_TIMEOUT_Bits;

/** \\brief  Watchdog Interrupt Clear Register */
typedef struct _Ifx_CIF_WD_ICR_Bits
{
    Ifx_Strict_32Bit ICR_WD_HSE_TO:1;       /**< \brief [0:0] Horizontal Start End Timeout (w) */
    Ifx_Strict_32Bit ICR_WD_HES_TO:1;       /**< \brief [1:1] Horizontal End Start Timeout (w) */
    Ifx_Strict_32Bit ICR_WD_VSE_TO:1;       /**< \brief [2:2] Vertical Start End Timeout (w) */
    Ifx_Strict_32Bit ICR_WD_VES_TO:1;       /**< \brief [3:3] Vertical End Start Timeout (w) */
    Ifx_Strict_32Bit reserved_4:28;         /**< \brief \internal Reserved */
} Ifx_CIF_WD_ICR_Bits;

/** \\brief  Watchdog Interrupt Mask Register */
typedef struct _Ifx_CIF_WD_IMSC_Bits
{
    Ifx_Strict_32Bit IMSC_WD_HSE_TO:1;      /**< \brief [0:0] Horizontal Start End Timeout (rw) */
    Ifx_Strict_32Bit IMSC_WD_HES_TO:1;      /**< \brief [1:1] Horizontal End Start Timeout (rw) */
    Ifx_Strict_32Bit IMSC_WD_VSE_TO:1;      /**< \brief [2:2] Vertical Start End Timeout (rw) */
    Ifx_Strict_32Bit IMSC_WD_VES_TO:1;      /**< \brief [3:3] Vertical End Start Timeout (rw) */
    Ifx_Strict_32Bit reserved_4:28;         /**< \brief \internal Reserved */
} Ifx_CIF_WD_IMSC_Bits;

/** \\brief  Watchdog Interrupt Set Register */
typedef struct _Ifx_CIF_WD_ISR_Bits
{
    Ifx_Strict_32Bit ISR_WD_HSE_TO:1;       /**< \brief [0:0] Horizontal Start End Timeout (w) */
    Ifx_Strict_32Bit ISR_WD_HES_TO:1;       /**< \brief [1:1] Horizontal End Start Timeout (w) */
    Ifx_Strict_32Bit ISR_WD_VSE_TO:1;       /**< \brief [2:2] Vertical Start End Timeout (w) */
    Ifx_Strict_32Bit ISR_WD_VES_TO:1;       /**< \brief [3:3] Vertical End Start Timeout (w) */
    Ifx_Strict_32Bit reserved_4:28;         /**< \brief \internal Reserved */
} Ifx_CIF_WD_ISR_Bits;

/** \\brief  Watchdog Masked Interrupt Status Register */
typedef struct _Ifx_CIF_WD_MIS_Bits
{
    Ifx_Strict_32Bit MIS_WD_HSE_TO:1;       /**< \brief [0:0] Horizontal Start End Timeout (r) */
    Ifx_Strict_32Bit MIS_WD_HES_TO:1;       /**< \brief [1:1] Horizontal End Start Timeout (r) */
    Ifx_Strict_32Bit MIS_WD_VSE_TO:1;       /**< \brief [2:2] Vertical Start End Timeout (r) */
    Ifx_Strict_32Bit MIS_WD_VES_TO:1;       /**< \brief [3:3] Vertical End Start Timeout (r) */
    Ifx_Strict_32Bit reserved_4:28;         /**< \brief \internal Reserved */
} Ifx_CIF_WD_MIS_Bits;

/** \\brief  Watchdog Raw Interrupt Status Register */
typedef struct _Ifx_CIF_WD_RIS_Bits
{
    Ifx_Strict_32Bit RIS_WD_HSE_TO:1;       /**< \brief [0:0] Horizontal Start End Timeout (r) */
    Ifx_Strict_32Bit RIS_WD_HES_TO:1;       /**< \brief [1:1] Horizontal End Start Timeout (r) */
    Ifx_Strict_32Bit RIS_WD_VSE_TO:1;       /**< \brief [2:2] Vertical Start End Timeout (r) */
    Ifx_Strict_32Bit RIS_WD_VES_TO:1;       /**< \brief [3:3] Vertical End Start Timeout (r) */
    Ifx_Strict_32Bit reserved_4:28;         /**< \brief \internal Reserved */
} Ifx_CIF_WD_RIS_Bits;

/** \\brief  Watchdog Vertical Timeout Register */
typedef struct _Ifx_CIF_WD_V_TIMEOUT_Bits
{
    Ifx_Strict_32Bit WD_VSE_TO:16;          /**< \brief [15:0] Watchdog Vertical Start End Timeout (rw) */
    Ifx_Strict_32Bit WD_VES_TO:16;          /**< \brief [31:16] Watchdog Vertical End Start Timeout (rw) */
} Ifx_CIF_WD_V_TIMEOUT_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Cif_union
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_BBB_ACCEN0_Bits B;
} Ifx_CIF_BBB_ACCEN0;

/** \\brief  Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_BBB_ACCEN1_Bits B;
} Ifx_CIF_BBB_ACCEN1;

/** \\brief  Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_BBB_CLC_Bits B;
} Ifx_CIF_BBB_CLC;

/** \\brief  General Purpose Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_BBB_GPCTL_Bits B;
} Ifx_CIF_BBB_GPCTL;

/** \\brief  Kernel Reset Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_BBB_KRST0_Bits B;
} Ifx_CIF_BBB_KRST0;

/** \\brief  Kernel Reset Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_BBB_KRST1_Bits B;
} Ifx_CIF_BBB_KRST1;

/** \\brief  Kernel Reset Status Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_BBB_KRSTCLR_Bits B;
} Ifx_CIF_BBB_KRSTCLR;

/** \\brief  Module Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_BBB_MODID_Bits B;
} Ifx_CIF_BBB_MODID;

/** \\brief  Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_CCL_Bits B;
} Ifx_CIF_CCL;

/** \\brief  Debug Path Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_DP_CTRL_Bits B;
} Ifx_CIF_DP_CTRL;

/** \\brief  Debug Path Frame/Line Counter Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_DP_FLC_STAT_Bits B;
} Ifx_CIF_DP_FLC_STAT;

/** \\brief  Debug Path Predivider Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_DP_PDIV_CTRL_Bits B;
} Ifx_CIF_DP_PDIV_CTRL;

/** \\brief  Debug Path Predivider Counter Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_DP_PDIV_STAT_Bits B;
} Ifx_CIF_DP_PDIV_STAT;

/** \\brief  Debug Path Timestamp Counter Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_DP_TSC_STAT_Bits B;
} Ifx_CIF_DP_TSC_STAT;

