HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxCif_regdef.h
/** \\brief  Debug Path User Defined Symbol Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_DP_UDS_Bits B;
} Ifx_CIF_DP_UDS;

/** \\brief  CIF Data Path Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_DPCL_Bits B;
} Ifx_CIF_DPCL;

/** \\brief  Extra Path Image Cropping Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_EP_IC_CTRL_Bits B;
} Ifx_CIF_EP_IC_CTRL;

/** \\brief  Extra Path Image Cropping Camera Displacement Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_EP_IC_DISPLACE_Bits B;
} Ifx_CIF_EP_IC_DISPLACE;

/** \\brief  Extra Path Image Cropping Horizontal Offset of Output Window
 * Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_EP_IC_H_OFFS_Bits B;
} Ifx_CIF_EP_IC_H_OFFS;

/** \\brief  Extra Path Image Current Horizontal Offset Of Output Window Shadow
 * Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_EP_IC_H_OFFS_SHD_Bits B;
} Ifx_CIF_EP_IC_H_OFFS_SHD;

/** \\brief  Extra Path Image Cropping Output Horizontal Picture Size Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_EP_IC_H_SIZE_Bits B;
} Ifx_CIF_EP_IC_H_SIZE;

/** \\brief  Extra Path Image Current Output Horizontal Picture Size Shadow
 * Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_EP_IC_H_SIZE_SHD_Bits B;
} Ifx_CIF_EP_IC_H_SIZE_SHD;

/** \\brief  Extra Path Image Cropping Maximum Horizontal Displacement Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_EP_IC_MAX_DX_Bits B;
} Ifx_CIF_EP_IC_MAX_DX;

/** \\brief  Extra Path Image Cropping Maximum Vertical Displacement Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_EP_IC_MAX_DY_Bits B;
} Ifx_CIF_EP_IC_MAX_DY;

/** \\brief  Extra Path Image Cropping Recenter Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_EP_IC_RECENTER_Bits B;
} Ifx_CIF_EP_IC_RECENTER;

/** \\brief  Extra Path Image Cropping Vertical Offset Of Output Window Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_EP_IC_V_OFFS_Bits B;
} Ifx_CIF_EP_IC_V_OFFS;

/** \\brief  Extra Path Image Current Vertical Offset Of Output Window Shadow
 * Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_EP_IC_V_OFFS_SHD_Bits B;
} Ifx_CIF_EP_IC_V_OFFS_SHD;

/** \\brief  Extra Path Image Cropping Output Vertical Picture Size Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_EP_IC_V_SIZE_Bits B;
} Ifx_CIF_EP_IC_V_SIZE;

/** \\brief  Extra Path Image Current Output Vertical Picture Size Shadow
 * Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_EP_IC_V_SIZE_SHD_Bits B;
} Ifx_CIF_EP_IC_V_SIZE_SHD;

/** \\brief  CIF Internal Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ICCL_Bits B;
} Ifx_CIF_ICCL;

/** \\brief  CIF Revision Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ID_Bits B;
} Ifx_CIF_ID;

/** \\brief  CIF Internal Reset Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_IRCL_Bits B;
} Ifx_CIF_IRCL;

/** \\brief  ISP Acquisition Horizontal Offset Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISP_ACQ_H_OFFS_Bits B;
} Ifx_CIF_ISP_ACQ_H_OFFS;

/** \\brief  ISP Acquisition Horizontal Size Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISP_ACQ_H_SIZE_Bits B;
} Ifx_CIF_ISP_ACQ_H_SIZE;

/** \\brief  ISP Acquisition Number of Frames Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISP_ACQ_NR_FRAMES_Bits B;
} Ifx_CIF_ISP_ACQ_NR_FRAMES;

/** \\brief  ISP Acquisition Properties Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISP_ACQ_PROP_Bits B;
} Ifx_CIF_ISP_ACQ_PROP;

/** \\brief  ISP Acquistion Vertical Offset Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISP_ACQ_V_OFFS_Bits B;
} Ifx_CIF_ISP_ACQ_V_OFFS;

/** \\brief  ISP Acquisition Vertical Size Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISP_ACQ_V_SIZE_Bits B;
} Ifx_CIF_ISP_ACQ_V_SIZE;

/** \\brief  ISP Global Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISP_CTRL_Bits B;
} Ifx_CIF_ISP_CTRL;

