HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxCif_regdef.h
/** \\brief  WD Object */
typedef volatile struct _Ifx_CIF_WD
{
    Ifx_CIF_WD_CTRL CTRL;                   /**< \brief 0, Watchdog Control Register */
    Ifx_CIF_WD_V_TIMEOUT V_TIMEOUT;         /**< \brief 4, Watchdog Vertical Timeout Register */
    Ifx_CIF_WD_H_TIMEOUT H_TIMEOUT;         /**< \brief 8, Watchdog Horizontal Timeout Register */
    Ifx_CIF_WD_IMSC IMSC;                   /**< \brief C, Watchdog Interrupt Mask Register */
    Ifx_CIF_WD_RIS RIS;                     /**< \brief 10, Watchdog Raw Interrupt Status Register */
    Ifx_CIF_WD_MIS MIS;                     /**< \brief 14, Watchdog Masked Interrupt Status Register */
    Ifx_CIF_WD_ICR ICR;                     /**< \brief 18, Watchdog Interrupt Clear Register */
    Ifx_CIF_WD_ISR ISR;                     /**< \brief 1C, Watchdog Interrupt Set Register */
} Ifx_CIF_WD;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Cif_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  CIF object */
typedef volatile struct _Ifx_CIF
{
    Ifx_CIF_BBB BBB;                        /**< \brief 0, BBB Object */
    unsigned char reserved_20[224];         /**< \brief 20, \internal Reserved */
    Ifx_CIF_CCL CCL;                        /**< \brief 100, Clock Control Register */
    unsigned char reserved_104[4];          /**< \brief 104, \internal Reserved */
    Ifx_CIF_ID ID;                          /**< \brief 108, CIF Revision Identification Register */
    unsigned char reserved_10C[4];          /**< \brief 10C, \internal Reserved */
    Ifx_CIF_ICCL ICCL;                      /**< \brief 110, CIF Internal Clock Control Register */
    Ifx_CIF_IRCL IRCL;                      /**< \brief 114, CIF Internal Reset Control Register */
    Ifx_CIF_DPCL DPCL;                      /**< \brief 118, CIF Data Path Control Register */
    unsigned char reserved_11C[996];        /**< \brief 11C, \internal Reserved */
    Ifx_CIF_ISP ISP;                        /**< \brief 500, ISP Object */
    unsigned char reserved_748[3512];       /**< \brief 748, \internal Reserved */
    Ifx_CIF_MI MI;                          /**< \brief 1500, MI Object */
    unsigned char reserved_1614[748];       /**< \brief 1614, \internal Reserved */
    Ifx_CIF_JPE JPE;                        /**< \brief 1900, JPE Object */
    unsigned char reserved_1990[2672];      /**< \brief 1990, \internal Reserved */
    Ifx_CIF_ISPIS ISPIS;                    /**< \brief 2400, ISPIS Object */
    unsigned char reserved_2434[204];       /**< \brief 2434, \internal Reserved */
    Ifx_CIF_WD WD;                          /**< \brief 2500, WD Object */
    unsigned char reserved_2520[224];       /**< \brief 2520, \internal Reserved */
    Ifx_CIF_LDS LDS;                        /**< \brief 2600, LDS Object */
    unsigned char reserved_2608[504];       /**< \brief 2608, \internal Reserved */
    Ifx_CIF_DP DP;                          /**< \brief 2800, DP Object */
    unsigned char reserved_2834[460];       /**< \brief 2834, \internal Reserved */
    Ifx_CIF_EP_IC EP_IC_1S[5];              /**< \brief 2A00, EP Object \note Array index shifted by 1. Example: defined register EP_IC_1S[0]/EP_IC_1S0 corresponds to user manual EP_IC_1S1, ... */
    unsigned char reserved_2F00[1536];      /**< \brief 2F00, \internal Reserved */
    Ifx_CIF_MIEP MIEP;                      /**< \brief 3500, MIEP Object */
    unsigned char reserved_3B00[1];         /**< \brief 3B00, \internal Reserved */
} Ifx_CIF;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXCIF_REGDEF_H */
